share/tutorials/incompressible/piso/ras/cavity/0/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.000765;

boundaryField
{
  movingWall
  {
    type            epsilonWallFunction;
    value           uniform 0.000765;
  }
  fixedWalls
  {
    type            epsilonWallFunction;
    value           uniform 0.000765;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
