share/tutorials/incompressible/piso/ras/cavity/0/omega
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1;

boundaryField
{
  movingWall
  {
    type            omegaWallFunction;
    value           uniform 1;
  }
  fixedWalls
  {
    type            omegaWallFunction;
    value           uniform 1;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
