share/tutorials/incompressible/piso/ras/cavity/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       1e-06;
    relTol          0.1;
    smoother        GaussSeidel;
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration on;
    agglomerator    faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels     1;
  }
  pFinal
  {
    $p;
    tolerance       1e-06;
    relTol          0;
  }
  "(U|k|epsilon|omega|R|nuTilda)"
  {
    solver          smoothSolver;
    smoother        GaussSeidel;
    tolerance       1e-05;
    relTol          0;
  }
}
PISO
{
  nCorrectors     2;
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
